       01   U-STB-MOCK-OUTCOME-STATUS.                                  DWSTUB
         03 U-STB-RECORD-HEADER-GP.                                     DWSTUB
            05 DT-FROM                       PIC 9(8).                  DWSTUB
            05 RECORD-TYPE                   PIC X(1).                  DWSTUB
         03 U-STB-DATA-GP.                                              DWSTUB
            05 STATUS-CODE                   PIC S9(2)                  DWSTUB
                                                 USAGE COMP-3.          DWSTUB
            05 STATUS-DESC                   PIC X(50).                 DWSTUB
            05 STATUS-TYPE                                              DWSTUB
                                             PIC X(20).                 DWSTUB
         03 U-STB-DATA-XP.                       OCCURS 3 TIMES.        DWSTUB
            05 EXTEND-CODE                   PIC S9(2)                  DWSTUB
                                                 USAGE COMP-3.          DWSTUB
