       01   U-POC-MOCK-OUTCOME-STATUS.                                  DWUPOC
         03 U-POC-RECORD-HEADER-GP.                                     DWUPOC
            05 DT-FROM                       PIC 9(8).                  DWUPOC
            05 RECORD-TYPE                   PIC X(1).                  DWUPOC
         03 U-POC-DATA-GP.                                              DWUPOC
            05 STATUS-CODE                   PIC S9(2)                  DWUPOC
                                                 USAGE COMP-3.          DWUPOC
            05 STATUS-DESC                   PIC X(50).                 DWUPOC
            05 STATUS-TYPE                                              DWUPOC
                                             PIC X(20).                 DWUPOC
